###############################################################
#  Generated by:      Cadence Innovus 18.10-p002_1
#  OS:                Linux x86_64(Host ID c111-15.EECS.Berkeley.EDU)
#  Generated on:      Mon Oct 30 10:16:39 2023
#  Design:            dot_product
#  Command:           write_db dot_product_FINAL -def -verilog
###############################################################
current_design dot_product
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 20.000000 -waveform {0.000000 10.000000}
set_propagated_clock  [get_ports {clk}]
set_load -pin_load -max  1  [get_ports {a_ready}]
set_load -pin_load -min  1  [get_ports {a_ready}]
set_load -pin_load -max  1  [get_ports {b_ready}]
set_load -pin_load -min  1  [get_ports {b_ready}]
set_load -pin_load -max  1  [get_ports {c_data[31]}]
set_load -pin_load -min  1  [get_ports {c_data[31]}]
set_load -pin_load -max  1  [get_ports {c_data[30]}]
set_load -pin_load -min  1  [get_ports {c_data[30]}]
set_load -pin_load -max  1  [get_ports {c_data[29]}]
set_load -pin_load -min  1  [get_ports {c_data[29]}]
set_load -pin_load -max  1  [get_ports {c_data[28]}]
set_load -pin_load -min  1  [get_ports {c_data[28]}]
set_load -pin_load -max  1  [get_ports {c_data[27]}]
set_load -pin_load -min  1  [get_ports {c_data[27]}]
set_load -pin_load -max  1  [get_ports {c_data[26]}]
set_load -pin_load -min  1  [get_ports {c_data[26]}]
set_load -pin_load -max  1  [get_ports {c_data[25]}]
set_load -pin_load -min  1  [get_ports {c_data[25]}]
set_load -pin_load -max  1  [get_ports {c_data[24]}]
set_load -pin_load -min  1  [get_ports {c_data[24]}]
set_load -pin_load -max  1  [get_ports {c_data[23]}]
set_load -pin_load -min  1  [get_ports {c_data[23]}]
set_load -pin_load -max  1  [get_ports {c_data[22]}]
set_load -pin_load -min  1  [get_ports {c_data[22]}]
set_load -pin_load -max  1  [get_ports {c_data[21]}]
set_load -pin_load -min  1  [get_ports {c_data[21]}]
set_load -pin_load -max  1  [get_ports {c_data[20]}]
set_load -pin_load -min  1  [get_ports {c_data[20]}]
set_load -pin_load -max  1  [get_ports {c_data[19]}]
set_load -pin_load -min  1  [get_ports {c_data[19]}]
set_load -pin_load -max  1  [get_ports {c_data[18]}]
set_load -pin_load -min  1  [get_ports {c_data[18]}]
set_load -pin_load -max  1  [get_ports {c_data[17]}]
set_load -pin_load -min  1  [get_ports {c_data[17]}]
set_load -pin_load -max  1  [get_ports {c_data[16]}]
set_load -pin_load -min  1  [get_ports {c_data[16]}]
set_load -pin_load -max  1  [get_ports {c_data[15]}]
set_load -pin_load -min  1  [get_ports {c_data[15]}]
set_load -pin_load -max  1  [get_ports {c_data[14]}]
set_load -pin_load -min  1  [get_ports {c_data[14]}]
set_load -pin_load -max  1  [get_ports {c_data[13]}]
set_load -pin_load -min  1  [get_ports {c_data[13]}]
set_load -pin_load -max  1  [get_ports {c_data[12]}]
set_load -pin_load -min  1  [get_ports {c_data[12]}]
set_load -pin_load -max  1  [get_ports {c_data[11]}]
set_load -pin_load -min  1  [get_ports {c_data[11]}]
set_load -pin_load -max  1  [get_ports {c_data[10]}]
set_load -pin_load -min  1  [get_ports {c_data[10]}]
set_load -pin_load -max  1  [get_ports {c_data[9]}]
set_load -pin_load -min  1  [get_ports {c_data[9]}]
set_load -pin_load -max  1  [get_ports {c_data[8]}]
set_load -pin_load -min  1  [get_ports {c_data[8]}]
set_load -pin_load -max  1  [get_ports {c_data[7]}]
set_load -pin_load -min  1  [get_ports {c_data[7]}]
set_load -pin_load -max  1  [get_ports {c_data[6]}]
set_load -pin_load -min  1  [get_ports {c_data[6]}]
set_load -pin_load -max  1  [get_ports {c_data[5]}]
set_load -pin_load -min  1  [get_ports {c_data[5]}]
set_load -pin_load -max  1  [get_ports {c_data[4]}]
set_load -pin_load -min  1  [get_ports {c_data[4]}]
set_load -pin_load -max  1  [get_ports {c_data[3]}]
set_load -pin_load -min  1  [get_ports {c_data[3]}]
set_load -pin_load -max  1  [get_ports {c_data[2]}]
set_load -pin_load -min  1  [get_ports {c_data[2]}]
set_load -pin_load -max  1  [get_ports {c_data[1]}]
set_load -pin_load -min  1  [get_ports {c_data[1]}]
set_load -pin_load -max  1  [get_ports {c_data[0]}]
set_load -pin_load -min  1  [get_ports {c_data[0]}]
set_load -pin_load -max  1  [get_ports {c_valid}]
set_load -pin_load -min  1  [get_ports {c_valid}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_clock_groups -name __default_2 -asynchronous  -group  [get_clocks {clk}]
